<h1> Code Examples | TEAM 47 </h1>
<h3>Creating a dataframe: </h3>

In [1]:
import pandas as pd
import numpy as np

# this turns off warning messages
import warnings
warnings.filterwarnings('ignore')

In [2]:
# Creating a dataframe:
users = [{'name': 'Kevin','lastname': 'Camelo', 'address' : '420 Lambreth Ln.', 'closestdining' : 'Goldstein Dining Hall', 'suid' : '338030842'},
        {'name': 'Cynthia','lastname': 'Gonzalez', 'address' : '330 Stadium Pl.', 'closestdining' : 'Sadler Dining Hall', 'suid' : '610349224'},
        {'name': 'Hanna','lastname': 'Yacubov', 'address' : '744 Euclid Ave.', 'closestdining' : 'Ernie Davis Dining Hall', 'suid' : '452630840'}]
donators = pd.DataFrame(users)
donators = donators[['name', 'lastname', 'address', 'closestdining', 'suid']]
donators.head()

      name  lastname           address            closestdining       suid
0    Kevin    Camelo  420 Lambreth Ln.    Goldstein Dining Hall  338030842
1  Cynthia  Gonzalez   330 Stadium Pl.       Sadler Dining Hall  610349224
2    Hanna   Yacubov   744 Euclid Ave.  Ernie Davis Dining Hall  452630840

<h3>Converting the dataframe into a CSV:</h3>

In [3]:
donators.to_csv('donators.csv', header = True, index = False)

<img src="CSVproof.png">

<h3>Reading and manipulating donators.csv with Pandas:</h3>

In [4]:
donatorlist = pd.read_csv('donators.csv')
donatorlist

      name  lastname           address            closestdining       suid
0    Kevin    Camelo  420 Lambreth Ln.    Goldstein Dining Hall  338030842
1  Cynthia  Gonzalez   330 Stadium Pl.       Sadler Dining Hall  610349224
2    Hanna   Yacubov   744 Euclid Ave.  Ernie Davis Dining Hall  452630840

In [5]:
#Using variables to append a new user onto the donator list.
first_name = input("Enter your first name: ")
last_name = input("Enter your last name: ")
address = input("Enter your address: ")
suid = input("Enter your SUID: ")
    
newuser = pd.DataFrame([[first_name, last_name, address, "none", suid]], columns = ['name', 'lastname', 'address', 'closestdining', 'suid'])
donatorlist.append(newuser, ignore_index = True)

Enter your first name: Hello
Enter your last name: How
Enter your address: Are
Enter your SUID: You

      name  lastname           address            closestdining       suid
0    Kevin    Camelo  420 Lambreth Ln.    Goldstein Dining Hall  338030842
1  Cynthia  Gonzalez   330 Stadium Pl.       Sadler Dining Hall  610349224
2    Hanna   Yacubov   744 Euclid Ave.  Ernie Davis Dining Hall  452630840
3    Hello       How               Are                     none        You

<h3>Adding a column to the data frame:</h3>

In [6]:
donatorlist['mealallotment'] = np.nan
donatorlist

,name,lastname,address,closestdining,suid,mealallotment
0,Kevin,Camelo,420 Lambreth Ln.,Goldstein Dining Hall,338030842,NaN
1,Cynthia,Gonzalez,330 Stadium Pl.,Sadler Dining Hall,610349224,NaN
2,Hanna,Yacubov,744 Euclid Ave.,Ernie Davis Dining Hall,452630840,NaN

In [7]:
#filling NAN values with 0's
donatorlist['mealallotment'] = donatorlist['mealallotment'].fillna(0)
donatorlist

,name,lastname,address,closestdining,suid,mealallotment
0,Kevin,Camelo,420 Lambreth Ln.,Goldstein Dining Hall,338030842,0.0
1,Cynthia,Gonzalez,330 Stadium Pl.,Sadler Dining Hall,610349224,0.0
2,Hanna,Yacubov,744 Euclid Ave.,Ernie Davis Dining Hall,452630840,0.0

<h3>Using an API to find the closest dining hall to an address:</h3>

<h3>Working with two dataframes to make changes to eachother:</h3>

<h3>Notifying a user based on a certain condition being met:</h3>

In [10]:
import time
time.localtime()

time.struct_time(tm_year=2018, tm_mon=11, tm_mday=30, tm_hour=20, tm_min=30, tm_sec=9, tm_wday=4, tm_yday=334, tm_isdst=0)